# Terminal & shell
brew "git"            # Keep git updated vs macOS system git
brew "stow"           # Symlink manager for dotfiles
brew "tmux"           # Terminal multiplexer
brew "zsh"            # Shell (macOS ships with it, but keep updated)
brew "neovim"         # Modern vim — our EDITOR
brew "starship"       # Minimal, fast prompt

# GUI apps
cask "iterm2"                    # Terminal emulator
cask "font-meslo-lg-nerd-font"   # Nerd Font for eza icons + starship glyphs

# Modern CLI replacements
brew "eza"            # ls replacement with icons and git awareness
brew "bat"            # cat replacement with syntax highlighting
brew "fd"             # find replacement (also used by fzf)
brew "fzf"            # Fuzzy finder
brew "ripgrep"        # Fast grep (used by telescope + general search)
brew "zoxide"         # cd replacement with frecency
brew "git-delta"      # Better git diffs with syntax highlighting
brew "jq"             # JSON processor
brew "tldr"           # Community-driven man pages
